#include "App.hpp"

int main() {
    RunApplication();
    return 0;
}
//main пустой
//BinaryTree.hpp 262 - что тут происходит? ---ВЫПОЛНЕНО---
//Добавить в main методы представления дерева в виде строки и дерева из строки ---ВЫПОЛНЕНО---
//в мееню работаетм только со значением (ключ = значение)(для инта) ---ВЫПОЛНЕНО---
//добавить функцию генерации случайного дерева по заданной высоте и кол-ву узлов, которые будут случайным образом раскиданы по дереву ---ВЫПОЛНЕНО---
//вывод дерева в виде дерева (чтобы можно было посмотреть как оно выглядит) // обьявил в BinaryTree.hpp ---ВЫПОЛНЕНО---
//BinaryTree.hpp 398 - что за конструктор для ноды? что такое first и second? возможно, стоит придумать название получше ---ВЫПОЛНЕНО---
//объяснить подробнее, как работает балансировка ---ВЫПОЛНЕНО---
//  ДОП ЗАДАНИЕ: ---ВЫПОЛНЕНО---
//метод построения из дерева строки вида: {(left)root(right)}
//метод построения строки из дерева
//проверка, что такая строка является корректной (что это в прицнипе является деревом)


